## 1. Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

x = int(input("Введите трехзначное число от 100 до 999 - "))
@@ -11,4 +11,4 @@
p = a * b * c

print(f'Сумма цифр трехзначного числа {x} равна: {s}')
print(f'Произведение цифр трехзначного числа {x} равна: {p}')
print(f'Произведение цифр трехзначного числа {x} равна: {p}')